---
kind: type
id: T:Autodesk.Revit.DB.PointClouds.CloudPoint
source: html/c780514e-fc08-e055-bda4-c4fe455c13d3.htm
---
# Autodesk.Revit.DB.PointClouds.CloudPoint

Represents a point obtained from a Point cloud.

## Syntax (C#)
```csharp
public struct CloudPoint
```